article/10.start-angular-project.org
#+TITLE: 编写Angular项目
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2018-10-08 Mon>
#+TAGS: frontend angular javascript


* 配置环境

[[https://angular.io/][Angular]] 是一个Google推出的新一代 Web 前端框架，其优点就不需要我详细叙述了，指的
一提的是，在 Angular 官网上有启动 Angular 项目的教程 [[https://angular.io/guide/quickstart][Angular Quick Start]]。
Angular 的提供中文阅读支撑，详见 [[https://www.angular.cn/][Angular中文版]]。

#+BEGIN_SRC sh
  # 使用 npm 安装
  npm install -g @angular/cli
  # 或者使用 yarn 安装
  yarn global add @angular/cli
#+END_SRC


* Angular 命令行

[[https://cli.angular.io/][Angular CLI]] 是高效管理 Angular 项目的一个命令行工具。

** 创建新项目 ng new

打开终端窗口。运行下列命令来生成一个新项目以及默认的应用代码。

#+BEGIN_SRC sh
  ng new my-project-name
#+END_SRC

如果想要生成使用 sass 开发的项目需要加入选项。

#+BEGIN_SRC sh
  ng new my-project-name --style=scss
#+END_SRC

** 启动项目 ng serve

安装依赖包和启动项目。命令如下：

#+BEGIN_SRC sh
  ng serve
#+END_SRC

** 生成代码模板 ng generate

*** 生成组件

#+BEGIN_SRC sh
  ng generate component my-component-name
#+END_SRC

CLI 创建了一个新的文件夹 src/app/my-component-name/，并生成了MyComponentName 的
相关文件。

*** 生成服务

#+BEGIN_SRC sh
  ng generate service my-service-name
#+END_SRC

CLI 创建 my-service-name.service.ts 文件，并生成了 MyServiceNameService 服务。

*** 生成路由

Angular 的最佳实践之一就是在一个独立的顶级模块中加载和配置路由器，它专注于路由功
能，然后由根模块 AppModule 导入它。

#+BEGIN_SRC sh
  ng generate module app-routing --flat --module=app
#+END_SRC

~--flat~ 把这个文件放进了 src/app 中，而不是单独的目录中。~--module=app~ 告诉
CLI 把它注册到 AppModule 的 imports 数组中。


* 参考链接

1. [[https://www.angular.cn/][Angular中文网]]
2. [[https://angular.io/][Official Angular English Site]]
3. [[https://angular.io/guide/quickstart][Angular Quick Start]]: nghero教程，代码参考 [[https://github.com/jeanhwea/ngheroes/tree/master/][nghero github repo]]
4. [[https://angular.io/api][Angular API List]]
5. [[https://angular.io/guide/cheatsheet][Angular Cheetsheet]]
