article/10.start-angular-project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>编写Angular项目</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">编写Angular项目</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4935bde">1. 配置环境</a></li>
<li><a href="#org843069d">2. Angular 命令行</a>
<ul>
<li><a href="#org42176e8">2.1. 创建新项目 ng new</a></li>
<li><a href="#orgcef1526">2.2. 启动项目 ng serve</a></li>
<li><a href="#org5475b1a">2.3. 生成代码模板 ng generate</a>
<ul>
<li><a href="#org7edaaec">2.3.1. 生成组件</a></li>
<li><a href="#org05e7837">2.3.2. 生成服务</a></li>
<li><a href="#org62f64e6">2.3.3. 生成路由</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9c8e630">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org4935bde" class="outline-2">
<h2 id="org4935bde"><span class="section-number-2">1</span> 配置环境</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://angular.io/">Angular</a> 是一个Google推出的新一代 Web 前端框架，其优点就不需要我详细叙述了，指的
一提的是，在 Angular 官网上有启动 Angular 项目的教程 <a href="https://angular.io/guide/quickstart">Angular Quick Start</a>。
Angular 的提供中文阅读支撑，详见 <a href="https://www.angular.cn/">Angular中文版</a>。
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#20351;&#29992; npm &#23433;&#35013;</span>
npm install -g @angular/cli
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#25110;&#32773;&#20351;&#29992; yarn &#23433;&#35013;</span>
yarn global add @angular/cli
</pre>
</div>
</div>
</div>


<div id="outline-container-org843069d" class="outline-2">
<h2 id="org843069d"><span class="section-number-2">2</span> Angular 命令行</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://cli.angular.io/">Angular CLI</a> 是高效管理 Angular 项目的一个命令行工具。
</p>
</div>

<div id="outline-container-org42176e8" class="outline-3">
<h3 id="org42176e8"><span class="section-number-3">2.1</span> 创建新项目 ng new</h3>
<div class="outline-text-3" id="text-2-1">
<p>
打开终端窗口。运行下列命令来生成一个新项目以及默认的应用代码。
</p>

<div class="org-src-container">
<pre class="src src-sh">ng new my-project-name
</pre>
</div>

<p>
如果想要生成使用 sass 开发的项目需要加入选项。
</p>

<div class="org-src-container">
<pre class="src src-sh">ng new my-project-name --style=scss
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcef1526" class="outline-3">
<h3 id="orgcef1526"><span class="section-number-3">2.2</span> 启动项目 ng serve</h3>
<div class="outline-text-3" id="text-2-2">
<p>
安装依赖包和启动项目。命令如下：
</p>

<div class="org-src-container">
<pre class="src src-sh">ng serve
</pre>
</div>
</div>
</div>

<div id="outline-container-org5475b1a" class="outline-3">
<h3 id="org5475b1a"><span class="section-number-3">2.3</span> 生成代码模板 ng generate</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org7edaaec" class="outline-4">
<h4 id="org7edaaec"><span class="section-number-4">2.3.1</span> 生成组件</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-sh">ng generate component my-component-name
</pre>
</div>

<p>
CLI 创建了一个新的文件夹 src/app/my-component-name/，并生成了MyComponentName 的
相关文件。
</p>
</div>
</div>

<div id="outline-container-org05e7837" class="outline-4">
<h4 id="org05e7837"><span class="section-number-4">2.3.2</span> 生成服务</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-sh">ng generate service my-service-name
</pre>
</div>

<p>
CLI 创建 my-service-name.service.ts 文件，并生成了 MyServiceNameService 服务。
</p>
</div>
</div>

<div id="outline-container-org62f64e6" class="outline-4">
<h4 id="org62f64e6"><span class="section-number-4">2.3.3</span> 生成路由</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Angular 的最佳实践之一就是在一个独立的顶级模块中加载和配置路由器，它专注于路由功
能，然后由根模块 AppModule 导入它。
</p>

<div class="org-src-container">
<pre class="src src-sh">ng generate module app-routing --flat --module=app
</pre>
</div>

<p>
<code>--flat</code> 把这个文件放进了 src/app 中，而不是单独的目录中。~&#x2013;module=app~ 告诉
CLI 把它注册到 AppModule 的 imports 数组中。
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org9c8e630" class="outline-2">
<h2 id="org9c8e630"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://www.angular.cn/">Angular中文网</a></li>
<li><a href="https://angular.io/">Official Angular English Site</a></li>
<li><a href="https://angular.io/guide/quickstart">Angular Quick Start</a>: nghero教程，代码参考 <a href="https://github.com/jeanhwea/ngheroes/tree/master/">nghero github repo</a></li>
<li><a href="https://angular.io/api">Angular API List</a></li>
<li><a href="https://angular.io/guide/cheatsheet">Angular Cheetsheet</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-08 Mon 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
